# College Major v.s. Salary - Data Analysis

### Questions
**1) Which degrees have the highest starting salaries?**

**2) Which majors have the lowest earnings after college?**

**3) Which degrees have the highest earning potential?**

**4) What are the lowest risk college majors from an earnings standpoint?**

**5) Do business, STEM (Science, Technology, Engineering, Mathematics) or HASS (Humanities, Arts, Social Science) degrees earn more on average?**

In [1]:
import pandas as pd

pd.options.display.float_format = "{:,.2f}".format

In [2]:
df = pd.read_csv("salaries_by_college_major.csv")
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,"46,000.00","77,100.00","42,200.00","152,000.00",Business
1,Aerospace Engineering,"57,700.00","101,000.00","64,300.00","161,000.00",STEM
2,Agriculture,"42,600.00","71,900.00","36,300.00","150,000.00",Business
3,Anthropology,"36,800.00","61,500.00","33,800.00","138,000.00",HASS
4,Architecture,"41,600.00","76,800.00","50,600.00","136,000.00",Business

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 6 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Undergraduate Major                51 non-null     object
 1   Starting Median Salary             50 non-null     float64
 2   Mid-Career Median Salary           50 non-null     float64
 3   Mid-Career 10th Percentile Salary  50 non-null     float64
 4   Mid-Career 90th Percentile Salary  50 non-null     float64
 5   Group                              50 non-null     object
dtypes: float64(4), object(2)
memory usage: 2.5+ KB

In [4]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Starting Median Salary,50.00,"44,310.00","9,360.87","34,000.00","37,050.00","40,850.00","49,875.00","74,300.00"
Mid-Career Median Salary,50.00,"74,786.00","16,088.40","52,000.00","60,825.00","72,000.00","88,750.00","107,000.00"
Mid-Career 10th Percentile Salary,50.00,"43,408.00","12,000.78","26,700.00","34,825.00","39,400.00","49,850.00","71,900.00"
Mid-Career 90th Percentile Salary,50.00,"142,766.00","27,851.25","96,400.00","124,250.00","145,500.00","161,750.00","210,000.00"

In [5]:
df[df.isnull().any(axis=1)]  # check at least one True (NaN) in row

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [6]:
df.dropna(axis=0, inplace=True)
df[df.isnull().any(axis=1)]

Empty DataFrame
Columns: [Undergraduate Major, Starting Median Salary, Mid-Career Median Salary, Mid-Career 10th Percentile Salary, Mid-Career 90th Percentile Salary, Group]
Index: []

In [7]:
df.shape

(50, 6)

In [8]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [9]:
df.iloc[df["Mid-Career Median Salary"].idxmax()]

Undergraduate Major                  Chemical Engineering
Starting Median Salary                          63,200.00
Mid-Career Median Salary                       107,000.00
Mid-Career 10th Percentile Salary               71,900.00
Mid-Career 90th Percentile Salary              194,000.00
Group                                                STEM
Name: 8, dtype: object

In [10]:
df.iloc[df["Mid-Career Median Salary"].idxmin()]

Undergraduate Major                  Education
Starting Median Salary               34,900.00
Mid-Career Median Salary             52,000.00
Mid-Career 10th Percentile Salary    29,300.00
Mid-Career 90th Percentile Salary   102,000.00
Group                                     HASS
Name: 18, dtype: object

In [11]:
spread_col = df["Mid-Career 90th Percentile Salary"].subtract(
    df["Mid-Career 10th Percentile Salary"]
)  # alternatively: df[col_A] - df[col_B]
df.insert(1, "Spread", spread_col)
df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,"109,800.00","46,000.00","77,100.00","42,200.00","152,000.00",Business
1,Aerospace Engineering,"96,700.00","57,700.00","101,000.00","64,300.00","161,000.00",STEM
2,Agriculture,"113,700.00","42,600.00","71,900.00","36,300.00","150,000.00",Business
3,Anthropology,"104,200.00","36,800.00","61,500.00","33,800.00","138,000.00",HASS
4,Architecture,"85,400.00","41,600.00","76,800.00","50,600.00","136,000.00",Business

In [12]:
# Low Risk
df.sort_values(
    by="Spread", ascending=True
)[["Undergraduate Major", "Spread"]].head()

           Undergraduate Major    Spread
40                     Nursing 50,700.00
43         Physician Assistant 57,600.00
41                   Nutrition 65,300.00
49                     Spanish 65,400.00
27  Health Care Administration 66,400.00

In [13]:
# Highest Potential
mid_90_col = "Mid-Career 90th Percentile Salary"
df.sort_values(by=mid_90_col, ascending=False)\
    [["Undergraduate Major", mid_90_col]].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                         210,000.00
22               Finance                         195,000.00
8   Chemical Engineering                         194,000.00
37                  Math                         183,000.00
44               Physics                         178,000.00

In [14]:
# Highest Spread
df.sort_values(
    by="Spread", ascending=False
)[["Undergraduate Major", "Spread"]].head()

   Undergraduate Major     Spread
17           Economics 159,400.00
22             Finance 147,800.00
37                Math 137,800.00
36           Marketing 132,900.00
42          Philosophy 132,500.00

In [15]:
df.groupby("Group").count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [16]:
df.groupby("Group").mean(numeric_only=True)

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"